# CantCopyElemsToInplaceFam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CopyPasteFailures..::..CantCopyElemsToInplaceFam Property
BuiltInFailures..::..CopyPasteFailures Class See Also
---
Can't copy element(s) to In Place family.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CantCopyElemsToInplaceFam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CantCopyElemsToInplaceFam As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CantCopyElemsToInplaceFam {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CopyPasteFailures Class
Autodesk.Revit.DB Namespace